## Tree main functions to combine datasets

* Merge

* Join 

* Concatenate

## Different ways to join/merge datasets


left            
        
- Use keys from left frame only

right
		
- Use keys from right frame only


inner


- Use intersection of keys from both frames


outer
	
- Use union of keys from both frames

cross

- combine every row with every other row

## MERGE

In [1]:
import pandas as pd

In [65]:
left_df = pd.DataFrame( 
    
    
            {
                "key": ["K0", "K1", "K2", "K3", "K4"],

                "A": ["A0", "A1", "A2", "A3", "A4"],

                "B": ["B0", "B1", "B2", "B3", "B4"]
       
            }

                      )



right_df = pd.DataFrame(

            {

                "key": ["K1", "K2", "K3", "K4", "K5"],

                "C": ["C1", "C2", "C3", "C4", "C5"],

                "D": ["D1", "D2", "D3", "D4", "D5"],

            }

                        )

In [66]:
left_df

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
4  K4  A4  B4

In [67]:
right_df

  key   C   D
0  K1  C1  D1
1  K2  C2  D2
2  K3  C3  D3
3  K4  C4  D4
4  K5  C5  D5

In [69]:
pd.merge(left_df, right_df, on='key', indicator=True)  # detta Ã¤r en, by default, inner join

  key   A   B   C   D _merge
0  K1  A1  B1  C1  D1   both
1  K2  A2  B2  C2  D2   both
2  K3  A3  B3  C3  D3   both
3  K4  A4  B4  C4  D4   both

notera skillnaden i ordningen och hur resultatet ser ut

In [7]:
pd.merge(right_df, left_df, on='key')

  key   C   D   A   B
0  K1  C1  D1  A1  B1
1  K2  C2  D2  A2  B2
2  K3  C3  D3  A3  B3
3  K4  C4  D4  A4  B4

**inner**

Notera ett inner Ã¤r default

In [11]:
pd.merge(left_df, right_df, on='key', how='inner')

  key   A   B   C   D
0  K1  A1  B1  C1  D1
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3
3  K4  A4  B4  C4  D4

**left**

In [12]:
left_df

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
4  K4  A4  B4

In [13]:
right_df

  key   C   D
0  K1  C1  D1
1  K2  C2  D2
2  K3  C3  D3
3  K4  C4  D4
4  K5  C5  D5

In [70]:
pd.merge(left_df, right_df, on='key', how='left', indicator=True)

  key   A   B    C    D     _merge
0  K0  A0  B0  NaN  NaN  left_only
1  K1  A1  B1   C1   D1       both
2  K2  A2  B2   C2   D2       both
3  K3  A3  B3   C3   D3       both
4  K4  A4  B4   C4   D4       both

In [15]:
pd.merge(right_df, left_df, on='key', how='left')

  key   C   D    A    B
0  K1  C1  D1   A1   B1
1  K2  C2  D2   A2   B2
2  K3  C3  D3   A3   B3
3  K4  C4  D4   A4   B4
4  K5  C5  D5  NaN  NaN

**right**

In [16]:
left_df

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
4  K4  A4  B4

In [17]:
right_df

  key   C   D
0  K1  C1  D1
1  K2  C2  D2
2  K3  C3  D3
3  K4  C4  D4
4  K5  C5  D5

In [18]:
pd.merge(left_df, right_df, on='key', how='right')

  key    A    B   C   D
0  K1   A1   B1  C1  D1
1  K2   A2   B2  C2  D2
2  K3   A3   B3  C3  D3
3  K4   A4   B4  C4  D4
4  K5  NaN  NaN  C5  D5

**outer**

In [19]:
left_df

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
4  K4  A4  B4

In [20]:
right_df

  key   C   D
0  K1  C1  D1
1  K2  C2  D2
2  K3  C3  D3
3  K4  C4  D4
4  K5  C5  D5

In [21]:
pd.merge(left_df, right_df, on='key', how='outer')

  key    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K1   A1   B1   C1   D1
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K4   A4   B4   C4   D4
5  K5  NaN  NaN   C5   D5

**cross**

In [26]:
data1 = {'A': [1, 2], 'B': [3, 4]}
df1 = pd.DataFrame(data1)

data2 = {'X': ['a', 'b'], 'Y': ['c', 'd']}
df2 = pd.DataFrame(data2)

In [27]:
df1

   A  B
0  1  3
1  2  4

In [28]:
df2

   X  Y
0  a  c
1  b  d

In [29]:
pd.merge(df1, df2, how='cross')

   A  B  X  Y
0  1  3  a  c
1  1  3  b  d
2  2  4  a  c
3  2  4  b  d

In [30]:
data1 = {'A': [1, 2], 'B': [3, 4]}
df1 = pd.DataFrame(data1)

data2 = {'X': ['a', 'b','c'], 'Y': ['d', 'e', 'f']}
df2 = pd.DataFrame(data2)

In [31]:
df1

   A  B
0  1  3
1  2  4

In [32]:
df2

   X  Y
0  a  d
1  b  e
2  c  f

In [33]:
pd.merge(df1, df2, how='cross')

   A  B  X  Y
0  1  3  a  d
1  1  3  b  e
2  1  3  c  f
3  2  4  a  d
4  2  4  b  e
5  2  4  c  f

In [35]:
df1

   A  B
0  1  3
1  2  4

In [36]:
df2

   X  Y
0  a  d
1  b  e
2  c  f

In [34]:
pd.merge(df2, df1, how='cross')

   X  Y  A  B
0  a  d  1  3
1  a  d  2  4
2  b  e  1  3
3  b  e  2  4
4  c  f  1  3
5  c  f  2  4

In [39]:
data1 = {'A': [1, 2], 'B': [3, 4]}
df1 = pd.DataFrame(data1)

data2 = {'A': ['a', 'b'], 'Y': ['c', 'd']}
df2 = pd.DataFrame(data2)

In [40]:
df1

   A  B
0  1  3
1  2  4

In [41]:
df2

   A  Y
0  a  c
1  b  d

In [45]:
pd.merge(df1, df2, how='cross', suffixes=['_left', '_right'])

   A_left  B A_right  Y
0       1  3       a  c
1       1  3       b  d
2       2  4       a  c
3       2  4       b  d

## Duplicerade nycklar

In [72]:
left_df = pd.DataFrame( 
    
    
            {
                "key": ["K0", "K1", "K2", "K3", "K4"],

                "A": ["A0", "A1", "A2", "A3", "A4"],

                "B": ["B0", "B1", "B2", "B3", "B4"]
       
            }

                      )



right_df = pd.DataFrame(

            {

                "key": ["K1", "K4", "K3", "K1", "K5"],

                "C": ["C1", "C2", "C3", "C4", "C5"],

                "D": ["D1", "D2", "D3", "D4", "D5"],

            }

                        )

In [62]:
left_df

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
4  K4  A4  B4

In [63]:
right_df

  key   C   D
0  K1  C1  D1
1  K4  C2  D2
2  K3  C3  D3
3  K1  C4  D4
4  K5  C5  D5

In [64]:
pd.merge(left_df, right_df, on='key', how='left')

  key   A   B    C    D
0  K0  A0  B0  NaN  NaN
1  K1  A1  B1   C1   D1
2  K1  A1  B1   C4   D4
3  K2  A2  B2  NaN  NaN
4  K3  A3  B3   C3   D3
5  K4  A4  B4   C2   D2

**Att inte ange kolumn att merge pÃ¥ (bad practice)**

In [75]:
left_df = pd.DataFrame( 
    
    
            {
                "key": ["K0", "K1", "K2", "K3", "K4"],

                "A": ["A0", "A1", "A2", "A3", "A4"],

                "B": ["B0", "B1", "B2", "B3", "B4"]
       
            }

                      )



right_df = pd.DataFrame(

            {

                "key": ["K1", "K2", "K3", "K4", "K5"],

                "C": ["C1", "C2", "C3", "C4", "C5"],

                "D": ["D1", "D2", "D3", "D4", "D5"],

            }

                        )

In [76]:
left_df

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
4  K4  A4  B4

In [77]:
right_df

  key   C   D
0  K1  C1  D1
1  K2  C2  D2
2  K3  C3  D3
3  K4  C4  D4
4  K5  C5  D5

In [78]:
pd.merge(left_df, right_df, how='inner')

  key   A   B   C   D
0  K1  A1  B1  C1  D1
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3
3  K4  A4  B4  C4  D4

**FÃ¶rÃ¶ka merge pÃ¥ icke gemensam kolumn**

In [79]:
pd.merge(left_df, right_df, on='A', how='inner')

KeyError: 'A'

**Att merga pÃ¥ flera kolumner samtidigt**

In [82]:
left_df = pd.DataFrame(

    {

        "key1": ["K0", "K0", "K1", "K2"],

        "key2": ["K0", "K1", "K0", "K1"],

        "A": ["A0", "A1", "A2", "A3"],

        "B": ["B0", "B1", "B2", "B3"],

    }

)



right_df = pd.DataFrame(

    {

        "key1": ["K0", "K1", "K1", "K2"],

        "key2": ["K0", "K0", "K0", "K0"],

        "C": ["C0", "C1", "C2", "C3"],

        "D": ["D0", "D1", "D2", "D3"],

    }

)

In [83]:
left_df

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [84]:
right_df

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [88]:
pd.merge(left_df, right_df, on=['key1', 'key2'], how='right')

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [87]:
pd.merge(left_df, right_df, on=['key1', 'key2'], how='left')

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [86]:
pd.merge(left_df, right_df, on=['key1', 'key2'], how='inner')

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

**ett ekvivalent sÃ¤tt att merga pÃ¥**

In [90]:
left_df = pd.DataFrame( 
    
    
            {
                "key": ["K0", "K1", "K2", "K3", "K4"],

                "A": ["A0", "A1", "A2", "A3", "A4"],

                "B": ["B0", "B1", "B2", "B3", "B4"]
       
            }

                      )



right_df = pd.DataFrame(

            {

                "key": ["K1", "K2", "K3", "K4", "K5"],

                "C": ["C1", "C2", "C3", "C4", "C5"],

                "D": ["D1", "D2", "D3", "D4", "D5"],

            }

                        )

In [91]:
left_df

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
4  K4  A4  B4

In [92]:
right_df

  key   C   D
0  K1  C1  D1
1  K2  C2  D2
2  K3  C3  D3
3  K4  C4  D4
4  K5  C5  D5

In [93]:
left_df.merge(right_df, on='key', how='inner')

  key   A   B   C   D
0  K1  A1  B1  C1  D1
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3
3  K4  A4  B4  C4  D4

In [94]:
pd.merge(left_df, right_df, on='key', how='inner')

  key   A   B   C   D
0  K1  A1  B1  C1  D1
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3
3  K4  A4  B4  C4  D4

**att merga pÃ¥ kolumner som inte heter samma sak**

In [96]:
left_df = pd.DataFrame( 
    
    
            {
                "key": ["K0", "K1", "K2", "K3", "K4"],

                "A": ["A0", "A1", "A2", "A3", "A4"],

                "B": ["B0", "B1", "B2", "B3", "B4"]
       
            }

                      )



right_df = pd.DataFrame(

            {

                "nyckel": ["K1", "K2", "K3", "K4", "K5"],

                "C": ["C1", "C2", "C3", "C4", "C5"],

                "D": ["D1", "D2", "D3", "D4", "D5"],

            }

                        )

In [97]:
left_df

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
4  K4  A4  B4

In [98]:
right_df

  nyckel   C   D
0     K1  C1  D1
1     K2  C2  D2
2     K3  C3  D3
3     K4  C4  D4
4     K5  C5  D5

In [103]:
pd.merge(left_df, right_df, left_on='key', right_on='nyckel')

  key   A   B nyckel   C   D
0  K1  A1  B1     K1  C1  D1
1  K2  A2  B2     K2  C2  D2
2  K3  A3  B3     K3  C3  D3
3  K4  A4  B4     K4  C4  D4